#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "e3d7307003c2ff32d9e1373938624458" -> "bcdd78d13076f85cdc8309d21f41a5a4"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "b55493ad8482498cd57b63ee989e2b95" -> "0642728a629a40e7859be93fb22e58a4"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "d6c5a5c5759a845b7cedf02761249070" -> "7f5d28e09836887593741a81cce233e0"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "9a030cbc5d3187e39b003fd7f2aabaf9" -> "8845a04d24e1cd958fd68d8c99b166ea"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "86376ed65e4772cec0ce8694af17da57" -> "609cf068e93ba288b6dc793254eb1b22"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "989d26a9c762ae67725f2da3aa5f93bb" -> "0644efd461817bff0e2a07ebcc083b7b"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "1d436d6787cde496f3aa2be6ec5cec13" -> "72ee5a6d8e87106805eeacabeb33aca0"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "6d7adfd7eb2bd3ac125b71e771c9db3c" -> "f06a6f1210ad101911babfa3e6bb21b6"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "97068fdd4005e4d6c95bb89c684da6fa" -> "3596df311ff2ae99e4e6489e6737043c"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "3888241f70c5d2b5245bd906e0787d0f" -> "f3ff1d316806f2684504a144f07314d8"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be created
  + resource "aws_s3_bucket_object" "delete_tags_function_object" {
      + acl                    = "private"
      + bucket                 = "kpinetwork-backend"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "61fb61854835a5a5d8153827e3524822"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "lambdas/demo/delete_tags_handler.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "buckets/../../dist/delete_tags_handler.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "aceebfdf40bafa8264f2e2d3f46a8575" -> "fc526a7df634c045387dc2a786de7349"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "b306572900d203c95b162189053d694b" -> "3ace401efc31e56bf462a47c9717bdae"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "39b748b49362e65b47f7aa3337e87f18" -> "f18f95ee122e38980d7cd433f226768f"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "23ba45bb0d3cd0c14bca50cc73c9163c" -> "dc01f8bc1fd9c8ea68273cefec792a30"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "a0aeeb9ac89f6d4edbca3ec1061c836d" -> "a9748dca89e2cfa2f50adcbdf7e91c4c"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "f0756313784d5e63215b122cdd795efa" -> "2ede9a6afa8864bcbefb504750891f0c"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "5248eaabc37af3fd53e5b09bd7dad30b" -> "93434c502a73452e1c00f7c00c901831"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "c06cbd8bb27d928adaeb78a7542bcf0a" -> "f994a9544a200d038f9cb8222282ad5a"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "f7b1ba80cc170b7262829f2af8bcdafe" -> "ae8ec3057331e42eb2e3c851580d7a20"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "22da3ed5064edfbc9ef0c6b6ffaf7e74" -> "9646e48412b7dc9c921f263acf395319"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "58462de39bd692ca8765ca9a129b8bd4" -> "33892ca2bf01a527789399e50de1da29"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "eadf60d5ee4262073c06cbdaf2ce1f42" -> "27dc85590dc613e419ffcc00888366ab"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "84d083f2b0999c391b7df628a5ec36e2" -> "09987bba7944495d0c54ed212b83abc1"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "510fb40b6200816909009a8517b4ed85" -> "ace98aa222fcfd98e28ce5126d8d03e5"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "6ab248cf39ea7512441273b842ecaf1f" -> "78bd0a4c8a6433704873d05bf2734d8d"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "9a37ae7609fa8a805472b4f07d0fa2f1" -> "de83ebdad4f5093eb8e37da034db749f"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "95c467d1517cf63292fa04dc773f0d8f" -> "8d11ebfd1b4c0629a2ad4ed681ac71f3"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "d1045d8f6402d750613b9704f77391df" -> "4a568cd928c696cf65689e8ae094961b"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "7a0f6725a3e3ced8b805266dbc1d2575" -> "b59f36ec00b2a101e453c44c071448cf"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "1e0bb79791f46adeccf05c4f65527a5e" -> "05fe5a76992dedf2b7ee8961ceed4457"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "5814eedded9fe655b60e6d58e8c31b97" -> "a9ed7417b718b93e43a3e89b82c96b83"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "b5b3c834dec9011b5eb6018af0b1b09b" -> "1f436e255298b75b614860ff3384919c"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "39fd90b2905335812c3c98dffe2b870f" -> "b0487b538c584deba9416be827c169a8"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "affdd8ab0d2eb1fdb0e3e7d29fb99593" -> "980ec063c2a3ca9c696ac55d243bd563"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "d1a147fff0e4c1127595f020c1ee6069" -> "d81147a15069e68c4ece05bb97058758"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "9fb6decb622c0f56e5301c64ba56e152" -> "e8ed00ee6baba43ec796298b5e526d57"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "927cb2352ebd796fb597b178dc197b68" -> "572c51a662b1b7e3dd56af9bbdf7f277"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "ef816ab7733ee155c0f58f8242ba8f52" -> "882789641f18830f0e5ab53552038552"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "MSHwkZl9+MRNjpqS2Mhiexw9kt7kXEY/G39IQu1v5xo=" -> "wBtEgQvvtEYSedJAH9q7JE5Db9zc1GyUFQaC3GZ4n14="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "fsfLINYfGWfngVfi3UUKhs121EmNcD2AcFl2f3rUCyY=" -> "Aye2mgO78+rttfxGyc9HfES+BRxGB8CQLdF95GySsgg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "EiJGirJmFr2+wtEcSzF6/MclnHlbnoxoFLerEp0D9V0=" -> "Lbe1KIX5aLjzdiLWuyioyeMSYh85T52EQB8ZiZHIf4s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "PwNIzWD8sggGLSFSyAZ767MROB1XR2YlWMCsZM65MKE=" -> "2432h47jGT8gOGQCGGb6a5m3IhPlYM5Z/Sdz7nPDgUY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-10-11T22:29:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "OWas56QxAggrHI0sbKJ3k1lBmQYKSh+vzHPQm4yW6Rs=" -> "cRzZsPimGwolDBfR9B+3gDqMW+GJH/+Q7u5sSOXN87c="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "KSP+RWS+UvxXzk+Fwa4zrc92EwfEa9NpNXibuaJbthk=" -> "PAFg/Fs8ffROkBz46lBvdaPVflZTjd8aqMu5cOS8Pok="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2022-10-11T22:29:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "3fJhm/ji9Q/VT126SEKt1I61mXxGlnn1tSOh1K1eNbw=" -> "I0ceE/GCFJxnE3L0WXmDQ252g2A8SR+kHYIHNE9208U="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:08.000+0000" -> (known after apply)
      ~ source_code_hash               = "JGkxAGocywI+vPrFRppaHmxM6FDGWT1AJgd6mYVzePw=" -> "FI98wJEcrDzKH0vyAjIIoCC90fhOQEMc0nY5PPN5j4U="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "ovZzTt/RhHfCogIdi4SKLAX19kBpQGEAVq8/YfpHeBg=" -> "/R531etTzwp6fVdWChXGNv5GLeY8kx+EGhgKoWRpFC0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2022-10-11T22:29:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "ry5IZhvZQXlsJSOb+rVNPeJmfoagC68qe+iGx+h7+ck=" -> "keHWGYCpiJZT8Y8cF2464wF8vin6PV7an+WsULjl/08="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be created
  + resource "aws_lambda_function" "delete_tags_lambda_function" {
      + arn                            = (known after apply)
      + function_name                  = "demo_delete_tags_lambda_function"
      + handler                        = "delete_tags_handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + s3_bucket                      = "kpinetwork-backend"
      + s3_key                         = "lambdas/demo/delete_tags_handler.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "Erk8upzrlBWJbhYH/njdY2lzJO9cZGKLE9fHTJg0ESw="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 100
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ACCESS_KEY"   = (sensitive)
              + "DB_HOST"      = (sensitive)
              + "DB_NAME"      = "demokpinetworkdb"
              + "DB_PASSWORD"  = (sensitive)
              + "DB_USERNAME"  = (sensitive)
              + "SECRET_KEY"   = (sensitive)
              + "USER_POOL_ID" = "us-west-2_usXw4S12D"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0bda66e4a9afc62a9",
            ]
          + subnet_ids         = [
              + "subnet-0264422b45299167e",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "BwEpx+NzFjQ05yRaudNnosF+Zp27iLrbUTvFNa2g2HY=" -> "bxN16eDp8ZBg+nW0Bb7VHjzYWN/QyAekF4mbYT2JFSQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-11T22:29:03.000+0000" -> (known after apply)
      ~ source_code_hash               = "wb5UPoMGzbBmEtFhlVFdgtrw81ObpG+zMLW6UjLsX44=" -> "aZtLoYtrluTbdaMFgaKxpG52oJt5QLhj0xg8kwaGv8g="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-10-11T22:29:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "jkbjS3zP9yl8I9lVPjrKniqMXqmbmr7D7mMUr2xabKg=" -> "9jzbTcFANTJJI7oiySs8YizdeUgstfuBRQaK/OjHA60="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "2dUxeSuC3HRd5ckJNOBJHmLxVfCuxqddavacHA/Yy08=" -> "oZILZIWlgorLmYGXKtZiLbkQlQQBBNy8juP3J4jbdXo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "IACNWALSi5jo7B/5QfbOFMH+ncoqApz/wCXGEZWM/zw=" -> "jmK+I8Bg+tEJ67l4/QHZ2fznXJZ9IM9QtCRsaFxzk0U="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2022-10-11T22:29:23.086+0000" -> (known after apply)
      ~ source_code_hash               = "st6ZxvECvQ2utv5Ym+hqZmd5ydh/HDDR+0VTS01ZzVk=" -> "KJNJoWIGAdwtt5MYT7KsKIDNN7Msw3FCl+20d9vtBmE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:30.000+0000" -> (known after apply)
      ~ source_code_hash               = "agarURpwJ5k2XqADb2zGp1Svb1CUcnlXvEevh4lzq5M=" -> "tO1aEKK0zOQ2J2Pqs88W9NarTBlMdmxT2/M28W3YSS0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:30.000+0000" -> (known after apply)
      ~ source_code_hash               = "RdhngHElLOKzpEFlx/hto/gJ/6VXhlBLrUZvBIk1qVw=" -> "jVOi4iuo4Mj+q4hzZKDi0njdfU6JJh08shZmpFsLVSs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "4W43Fu7SEZzzoH+9gGfHejos6UT69raPGBVbicN4jiI=" -> "SpxdwnEqxz6NRTDqPPnG9TWuwTuGuSBfMv0vAcpNFKc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "O2NJo2BUVBOMMcKEsYG6ylKuUsj+YWPYOff38BdEwWY=" -> "zei0Ij2xieiRzyNrFXXmRVfHFom5YEn2zJ/csbkNUtg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "IUR2trABaJh8lZcWQI0tMhq5P0tgt5Wni3sH8PnqwsI=" -> "Xb+eAQKPpUqW5Pmj8r4ZAzrcJp9JNQ8KpHCi5T7kG08="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:30.000+0000" -> (known after apply)
      ~ source_code_hash               = "wsirE8StrIGEO00/oLiw0pHZpTew2LO4HvPOc1KzEUI=" -> "2OXouO6xNcBhIFtJxH2D6AuN/lFS0rKIXyXCMXuUslw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "2dFBbw61xP8cr55rQ1tdXgKZV1mlW+TQa08rWUHekaQ=" -> "CY+6YluHG9yj6GF311C1iL/s+JMV7LwmM9AGwqh9rFw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "jhVmgieH63sjb0Q+eIwSozxDMZGyBWKkcpzaLVgUy2s=" -> "CJLqdyt5UWGV/+aM84xmkwagL55nKp9L4yHjIuQk6D0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "rfSETxWmIDCxE3Sz/yT21QGPIZnlhjQXX6GI/nP1dEA=" -> "nGVPSRLaBZiEHRuwZFzR/GoTfzA/VTcZ5gPRN9x07FA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "QAL28N0rR8pAnoAB76hZzYjw7BhNSbW2UDRQauCQuUM=" -> "V66UyqU2Eyjotc+U492f2l1aJ/oEeK2oeK6Ty340e+k="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:48.000+0000" -> (known after apply)
      ~ source_code_hash               = "yL1o7Y+IUnHT8n9GHwKRJ029sG4FJuHLF8ISeXLz/lY=" -> "CXcjjbMcUjXpHbtUVj6hRMWevwCBGgoZ5cAc/kXyimo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-10-11T22:29:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "UVQUWalksA8snMWPP2FsSL79LfGNvnlRXMzK/vT7B6g=" -> "hgP3pjdKBXSEpCjyd62bvoRiFhdh0tUibHeC3gZwunM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-10-11T22:29:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "VoUwIMDWBHtANVZyFbrzuBCDBfVlWAZ1vF1CK37qsy4=" -> "rrf5AZwKAPnuf8JnDp03dPYx9eO4mOVGLkvu38gFrrY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "P+keut76Dp0S5kWaW1p6Iz12hm2PLL76zhifeN31TH8=" -> "Esidf5qgJqrs+jmM3Q7TwhCZVUit3FsoktQ2RjuV1H0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "QNNnoK51BPfY6JyD5N0qzcNt8I0nIi/FFBWUbtHDU9s=" -> "3g3uWzfFrFz5HDob/WPC8r9uttvl0cQoY7QXQFCBhjw="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "dHw5z7IDVnNO7/UyCpf0P/3j9QRvGwKznALj0kFqDBc=" -> "nCLS5DquLg88afwnsMRrJjeQJBsfjlHwJMczcentFCw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "YNWa76kJ9nR8/gCXgIHfhyCa1erdNrfm0AgLINnRLUM=" -> "zQToF19DrAwIkt44y2hU6mJU+zm011tDQKZbztCBNwo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "QM2rVbEUuCEL+fjQGrwXHKpkLZwK78RstWlLEKrcV2k=" -> "gVkyHTfghu7pPSUL6EeHyEc5f+bJcAT64SdR0F0ync0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "EJ9bT0pgeDx6T+PvjnVlrfPrdocgEZfOltgKMKENKb4=" -> "0odvUSawF1MKHxCHQtNPbfRUuROQbTzeH/vNfm6kpxs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "WRDlzaQQbkncPCuEGuCZBfdI4ytbYQuXlThbYewRRHE=" -> "MuPndougR6WdyZ3i0GwA72hkvOa1LICc2WD6oB37XV0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "W8BDS1NQKBQbbQNaA90zpZc9O6HIZBA792czWdepkJE=" -> "7N9DwHZ3rsKYo0d7mmXrqexmZ1P2V+XI7ar9Bg6du6Q="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-10-11T22:27:35Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "ret4qs" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-10-11T22:27:32Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.logs.aws_cloudwatch_log_group.delete_tags_lambda_function will be created
  + resource "aws_cloudwatch_log_group" "delete_tags_lambda_function" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/demo_delete_tags_lambda_function"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # module.network.aws_api_gateway_integration.delete_tags_integration will be created
  + resource "aws_api_gateway_integration" "delete_tags_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "DELETE"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "jp8jt7"
      + rest_api_id             = "kb7gblbu69"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.network.aws_api_gateway_method.delete_tags_method will be created
  + resource "aws_api_gateway_method" "delete_tags_method" {
      + api_key_required = false
      + authorization    = "CUSTOM"
      + authorizer_id    = "3y14fs"
      + http_method      = "DELETE"
      + id               = (known after apply)
      + resource_id      = "jp8jt7"
      + rest_api_id      = "kb7gblbu69"
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2022-10-11T22:29:18Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

  # module.policy.aws_iam_role.delete_tags_lambda_exec_role will be created
  + resource "aws_iam_role" "delete_tags_lambda_exec_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Allows Lambda Function to call AWS services on your behalf."
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "demo_delete_tags_lambda_exec_role"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.policy.aws_iam_role_policy.delete_tags_cognito_policy will be created
  + resource "aws_iam_role_policy" "delete_tags_cognito_policy" {
      + id     = (known after apply)
      + name   = "demo_delete_tags_cognito_policy"
      + policy = (sensitive)
      + role   = (known after apply)
    }

  # module.policy.aws_iam_role_policy_attachment.delete_tags_lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "delete_tags_lambda_logs" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_logging_function"
      + role       = "demo_delete_tags_lambda_exec_role"
    }

  # module.policy.aws_iam_role_policy_attachment.delete_tags_lambda_vpc will be created
  + resource "aws_iam_role_policy_attachment" "delete_tags_lambda_vpc" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_network_function"
      + role       = "demo_delete_tags_lambda_exec_role"
    }

  # module.policy.aws_lambda_permission.apigw_delete_tags_lambda will be created
  + resource "aws_lambda_permission" "apigw_delete_tags_lambda" {
      + action        = "lambda:InvokeFunction"
      + function_name = "demo_delete_tags_lambda_function"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = (sensitive)
      + statement_id  = "AllowExecutionFromAPIGateway"
    }

  # module.policy.aws_lambda_permission.apigw_get_all_tags_lambda must be replaced
-/+ resource "aws_lambda_permission" "apigw_get_all_tags_lambda" {
      ~ id            = "AllowExecutionFromAPIGatewayGetAllTags" -> (known after apply)
      - qualifier     = "" -> null
      ~ statement_id  = "AllowExecutionFromAPIGatewayGetAllTags" -> "AllowExecutionFromAPIGatewayRuleOf40" # forces replacement
        # (4 unchanged attributes hidden)
    }

Plan: 12 to add, 77 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @kellycastrof, Action: `pull_request`*